app/views/events/index.html.erb

	<% if event.user.id != @user.id %>
	<td><% unless event.users.include?(current_user) %>
---
SELECT  1 AS one FROM "users" INNER JOIN "event_users" ON "users"."id" = "event_users"."user_id" WHERE "event_users"."event_id" = $1 AND "users"."id" = $2 LIMIT 1  [["event_id", 2], ["id", 1]]

	<% else %>
		<form action = "/event_users/<%= EventUser.where(user: current_user, event: event).first.id%>" method = "post">
---
SELECT  "event_users".* FROM "event_users" WHERE "event_users"."user_id" = 1 AND "event_users"."event_id" = 2  ORDER BY "event_users"."id" ASC LIMIT 1