app/controllers/comments_controller.rb

	def create
    Comment.create comment_user_params
---
INSERT INTO "comments" ("event_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_id", 2], ["content", "work blows!"], ["user_id", 2], ["created_at", "2017-06-22 18:31:00.276781"], ["updated_at", "2017-06-22 18:31:00.276781"]]