app/controllers/events_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "events".* FROM "events"
---
  def index
  	@user = User.find(session[:user_id])
  	@events = Event.all

INSERT INTO "events" ("name", "date", "location", "state", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Party"], ["date", "2018-11-12"], ["location", "My house!"], ["state", "CA"], ["user_id", 2], ["created_at", "2017-06-21 21:43:16.098287"], ["updated_at", "2017-06-21 21:43:16.098287"]]
---
  def create
    event = Event.new event_params
    unless event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
  	@event = Event.find(params[:id])
  	@user = User.find(session[:user_id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "events" SET "location" = $1, "state" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["location", "not stuff"], ["state", "CA"], ["updated_at", "2017-06-21 22:45:59.652473"], ["id", 2]]
---
  def update
    @event = Event.find(params[:id])
    if @event.update event_params

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 3]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy if @event.user === current_user