app/controllers/event_users_controller.rb

	def create
    EventUser.create event_user_params
---
INSERT INTO "event_users" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 2], ["user_id", 1], ["created_at", "2017-06-22 00:14:39.924751"], ["updated_at", "2017-06-22 00:14:39.924751"]]

  def destroy
    @event_user = EventUser.find(params[:id])
    @event_user.destroy if current_user === @event_user.user
---
SELECT  "event_users".* FROM "event_users" WHERE "event_users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "event_users" WHERE "event_users"."id" = $1  [["id", 1]]