app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "lname", "email", "location", "state", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new user_params
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "location" = $1, "state" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["location", "kladsklj"], ["state", "CA"], ["updated_at", "2017-06-21 23:05:44.789365"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update user_params